0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2.35e-03;

boundaryField
{

	amont_bas
	{ 
	        type            fixedValue;
	        value           uniform 2.35e-03;
	}

	amont_haut
	{ 
        	type            inletOutlet;
        	inletValue      uniform 0.0023;
        	value           uniform 0.0023;
	}

	aval_bas
	{ 
	        //type            fixedValue;
        	type            inletOutlet;
        	inletValue      uniform 0.0023;
        	value           uniform 0.0023;
	}

	aval_haut
	{
        	type            inletOutlet;
        	inletValue      uniform 0.0023;
        	value           uniform 0.0023;
	}

  	haut
  	{
        	type            inletOutlet;
        	inletValue      uniform 0.0023;
        	value           uniform 0.0023;
  	}
  
  	"wall_.*"
  	{
        	type            epsilonWallFunction;
        	Cmu             0.09;
        	kappa           0.41;
        	E               9.8;
        	value           uniform 0.0023;
  	}
}


// ************************************************************************* //
