0.orig/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class volScalarField; 	
 location "0"; 	
 object nut; 	
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 1.0; 	

boundaryField
{
  "amont_.*"
  {
        type	calculated;
	value	$internalField;
    }
  
  "aval_.*"
  {
        type	calculated;
	value	$internalField;
   }
  
  haut
  {
        type	calculated;
	value	$internalField;
  }
   
  "wall_.*"
  {
        type            nutUWallFunction;
	value	$internalField;
  }
  
 }
