system/faceSource_plan.cfg
    planFlux_X1
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        outputControl   timeStep;
        log             false; //true;
        // Output field values as well
        valueOutput     false;
        source          faceZone;
        sourceName      planX1;
        operation       sum;

        fields
        (
            rhoPhi    
        );
    }

    planFlux_X2
    {
        $planFlux_X1;
        sourceName      planX2;
    }

    planFlux_X3
    {
        $planFlux_X1;
        sourceName      planX3;
    }

    planFlux_X4
    {
        $planFlux_X1;
        sourceName      planX4;
    }

    planFlux_X6
    {
        $planFlux_X1;
        sourceName      planX6;
    }

    planFlux_X7
    {
        $planFlux_X1;
        sourceName      planX7;
    }

    planFlux_X8
    {
        $planFlux_X1;
        sourceName      planX8;
    }

    planFlux_X9
    {
        $planFlux_X1;
        sourceName      planX9;
    }

    planFlux_X4p75
    {
        $planFlux_X1;
        sourceName      planX4p75;
    }

    planFlux_X5p25
    {
        $planFlux_X1;
        sourceName      planX5p25;
    }

