system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

zNVamont  0.3175; //1.3;
zNVaval   0.08; //1.2;
xMin    0.0;
xDev    8;
xMax    16.002;

yMin    0.0;
yMax    0.635;

zMin    0.0;

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U          (0.001 0 0)
);

regions
(
    boxToCell
    {
        box ($xMin $yMin $zMin) ($xDev $yMax $zNVamont);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    boxToCell
    {
        box ($xDev $yMin $zMin) ($xMax $yMax $zNVaval);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);


// ************************************************************************* //
